### Pandas DataFrame exersizes = https://www.w3resource.com/python-exercises/pandas/index-dataframe.php

In [1]:
import pandas as pd
import numpy as np

In [2]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data=exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

##### 54. Write a Pandas program to convert a given list of lists into a Dataframe.

In [6]:
from_list = [[2, 4], [1, 3]]
list_df = pd.DataFrame(from_list)
list_df

   0  1
0  2  4
1  1  3

##### 55. Write a Pandas program to group by the first column and get second column as lists in rows.

In [31]:
group_by = [['C1', 'C1', 'C1', 'C2', 'C2', 'C2', 'C2'], [1, 2, 3, 4, 5, 6, 7]]
group_df = pd.DataFrame(group_by).T.rename({0: 'one', 1: 'two'}, axis=1)
group_df.groupby('one')['two'].apply(list)

one
C1       [1, 2, 3]
C2    [4, 5, 6, 7]
Name: two, dtype: object

##### 56. Write a Pandas program to get column index from column name of a given DataFrame.

In [43]:
group_df.columns.get_loc('two')

1

##### 57. Write a Pandas program to count number of columns of a DataFrame.

In [46]:
len(df.columns)

4

##### 58. Write a Pandas program to select all columns, except one given column in a DataFrame.

In [49]:
df_sel = df.copy()
df_sel.loc[:,df.columns != 'attempts']

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

##### 59. Write a Pandas program to get first n records of a DataFrame.

In [51]:
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

##### 60. Write a Pandas program to get last n records of a DataFrame.

In [52]:
df.tail(3)

    name  score  attempts qualify
h  Laura    NaN         1      no
i  Kevin    8.0         2      no
j  Jonas   19.0         1     yes

##### 61. Write a Pandas program to get topmost n records within each group of a DataFrame.

In [64]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
d_df = pd.DataFrame(d)
print(d_df.nlargest(3, 'col1'))
print(d_df.nlargest(3, 'col2'))
print(d_df.nlargest(3, 'col3'))

   col1  col2  col3
5    11     0    11
4     7     5     1
3     4     9    12
   col1  col2  col3
3     4     9    12
2     3     6     8
1     2     5     5
   col1  col2  col3
3     4     9    12
5    11     0    11
2     3     6     8